1. Contructor(default - no args and overloaded)
   overloading -> same name, but various args



   Encapsulation(private, public, package-private)
   
   Inheritance -> is-a -> super -> overriding
	
   Abstraction -> Parent p = new Child(); -> instanceof operator
   
   Polymorphism -> overriding
    
   
   Debug mode in Intellij
       Breakpoints
       Step Over, Step In, Step Out, Resume

   UML(Class Diagram)
       https://en.wikipedia.org/wiki/Class_diagram
       http://www.objectmentor.com/resources/articles/umlClassDiagrams.pdf
       http://www.ibm.com/developerworks/rational/library/content/RationalEdge/sep04/bell/
       https://www.youtube.com/watch?v=3cmzqZzwNDM

   Class and Relations(has-a and is-a)

   Formatter -> String.format, System.out.printf
    class Date

    super class Object
    methods: toString and equals
    difference between 'equals' and '=='

    If you want share your homework via git -> https://www.youtube.com/watch?v=R6JomxUjTq8&feature=youtu.be

2. Debug or visualize class work! IMPORTANT TASK
    https://github.com/presly808/ACO6/tree/master/src/ua/artcode/week1/contact_list

BEFORE writing code, draw class diagram!!!

3*. Предметная область - Библиотека
   Основные классы: Библиотека, Книга, Читатель

   Написать программу позволяющую узнать следующую информацию:
     1) посмотреть список читателей
     2) посмотреть список доступных книг
     3) добавить книгу в библиотеку
     4) добавить читателя в список читателей
     5) выдать книгу читателю (если книга есть в наличии).
        Читателю запрещается брать больше 3-х книг.
     6) посмотреть список книг, которые находятся у читателей
     7) посмотреть список книг, которые находятся у конкретного читателя
     8) добавить читателя в черный список (ему нельзя выдавать книги)
     9) посмотреть книги конкретного автора
     10) посмотреть новые книги (год издания выше 2013)

4*. discover all structure, see uml of below applications(run and debug each applications)
    2.1. https://github.com/presly808/ACO6/tree/master/src/ua/artcode/service_centre/v2/centre_mvc
         https://github.com/presly808/ACO6/blob/master/src/ua/artcode/service_centre/v2/centre_mvc/diagram.png

    2.2. https://github.com/presly808/ACO6/tree/master/src/ua/artcode/service_centre/v3/service_centre
         https://github.com/presly808/ACO6/blob/master/src/ua/artcode/service_centre/v3/service_centre/diagram.png

    2.3. https://github.com/presly808/ACO6/tree/master/src/ua/artcode/dp/mvc
         https://github.com/presly808/ACO6/blob/master/src/ua/artcode/dp/mvc/mvc_simple.png

    2.4. https://github.com/presly808/ACO6/tree/master/src/ua/artcode/service_centre/v1
         https://github.com/presly808/ACO6/blob/master/src/ua/artcode/service_centre/v1/diagram.png

